Repository: bujnovskyf/legal-audit
Catalog: apps/frontend/lib/l10n/app_*.arb
Languages: cs

# enterUrl
source: Enter the website URL for audit:
cs: Zadejte URL webové stránky pro audit:

source: Start Audit
cs: Spustit audit

source: Error
cs: Chyba

# errorNoUrl
source: Error: Missing URL for repeated audit.
cs: Chyba: Chybí URL pro opakovaný audit.

source: No results
cs: Žádné výsledky

source: No results available.
cs: Výsledky nejsou k dispozici.

# consentCollects
source: COLLECTS DATA BEFORE CONSENT (bad)
cs: SBÍRÁ DATA JEŠTĚ PŘED SOUHLASEM (špatně)

# consentDoesNotCollect
source: DOES NOT COLLECT DATA WITHOUT CONSENT (good)
cs: NESBÍRÁ DATA BEZ SOUHLASU (dobře)

# consentUnknown
source: CANNOT EVALUATE (possibly misconfigured)
cs: NELZE VYHODNOTIT (možná špatně nastavené)

# privacyPolicyTitle
source: Privacy Policy
cs: Zásady ochrany osobních údajů

# cookiePolicyTitle
source: Cookie Policy
cs: Zásady cookies

# termsOfUseTitle
source: Terms of Use
cs: Obchodní podmínky

# docNotFound
source: Document not provided or not found.
cs: Dokument nebyl zadán nebo nebyl nalezen.

# cacheInfo
source: This is a cached audit result from the last hour. You can run the audit again if needed.
cs: Toto je uložený výsledek auditu z poslední hodiny. Pokud potřebujete, můžete spustit audit znovu.

# dialogRunAgainTitle
source: Really run audit again?
cs: Opravdu spustit audit znovu?

# dialogRunAgainContent
source: Running a new audit for this site costs real money (API and server costs). Only use this option if you really need a new audit. Do you want to continue?
cs: Spuštění nového auditu této stránky stojí reálné peníze (API a serverové náklady). Použij tuto možnost pouze pokud opravdu potřebuješ provést nový audit. Chceš opravdu pokračovat?

source: Cancel
cs: Zrušit

source: Run again
cs: Spustit znovu

# docUrls
source: Document URLs:
cs: URL k dokumentům:

source: Missing Documents
cs: Chybějící dokumenty

source: None
cs: Žádné

# detectedTrackers
source: Trackers Detected
cs: Detekované trackery

source: Run AI analysis
cs: Spustit AI analýzu

source: AI analysis results:
cs: Výsledky AI analýzy:

# aiLanguageInfo
source: The AI audit output will be in: {lang}. Change language in the top right.
cs: Výstup AI analýzy bude v jazyce: {lang}. Jazyk změníte vpravo nahoře.

# languageCzech
source: Czech
cs: čeština

# languageEnglish
source: English
cs: angličtina

# error500
source: The server could not process the page. Please check that you are entering a valid and existing web address. (error 500)
cs: Server nedokázal stránku zpracovat. Zkontrolujte, že zadáváte platnou a existující webovou adresu. (chyba 500)

# error404
source: Page not found. (error 404)
cs: Stránka nebyla nalezena. (chyba 404)

# error429
source: Too many requests. Please try again later. (error 429)
cs: Příliš mnoho požadavků. Zkuste to prosím později. (chyba 429)

# errorAiAlreadyRun
source: AI analysis has already been performed. (error 429)
cs: AI analýza už byla provedena. (chyba 429)

# errorNetwork
source: The specified address is not available. Please check your connection or the validity of the address. (detail: {error})
cs: Zadaná adresa není dostupná. Zkontrolujte připojení nebo platnost adresy. (detail: {error})

# errorGeneric
source: An error occurred during processing. ({error})
cs: Nastala chyba při zpracování. ({error})

# errorEnterUrl
source: Enter the URL
cs: Vyplňte URL

# errorInvalidUrl
source: Please enter a valid website address (e.g. https://example.com)
cs: Zadejte platnou adresu webové stránky (např. https://example.com)

source: About
cs: O projektu

# aboutProject
source: About this project
cs: O projektu

source: Close
cs: Zavřít

source: Built by
cs: Vytvořeno

# starOn
source: Star us on
cs: Dejte nám hvězdičku na

source: Compliance
cs: Shoda

source: Website URL
cs: Adresa webu

source: Run Audit
cs: Spustit audit

# aboutText
source: Legal Audit is an experimental tool for rapid legal auditing of websites. What does it do? • Finds and analyzes key legal documents (privacy policy, cookie policy, terms of use) at the given address. • Evaluates their availability, structure, and some key requirements. • Detects selected trackers and analytics tools, including Google Analytics 4, Google Ads Remarketing, Facebook Pixel, Sklik Remarketing, Microsoft Ads Remarketing, Microsoft Clarity, Hotjar, TikTok Pixel, LinkedIn Insight Tag, and X (Twitter) Pixel. • Shows the default consent (e.g., cookies) set on the site and what is stored before user interaction. • Uses an AI model (Grok) to provide qualitative analysis of document content. How to use? 1. Enter the website address you want to analyze. 2. Run the audit and wait for the tool to find documents, analyze consent, and detect trackers. 3. Check and, if needed, edit the found documents. 4. Run the AI analysis for a more detailed assessment. 5. Review the results and see missing or unsatisfactory parts and AI analysis details. Tech stack: Flutter, Supabase, Vercel, Grok 3. This tool was created as part of the Narrativva Labs project. For any questions or issues, contact us at
cs: Legal Audit je experimentální nástroj pro rychlý právní audit webových stránek. Co dělá? • Najde a analyzuje klíčové právní dokumenty (zásady ochrany osobních údajů, cookie policy, podmínky užití) na dané adrese. • Vyhodnotí jejich dostupnost, strukturu a některé základní požadavky. • Detekuje vybrané trackery a analytické nástroje, včetně Google Analytics 4, Google Ads Remarketing, Facebook Pixel, Sklik Remarketing, Microsoft Ads Remarketing, Microsoft Clarity, Hotjar, TikTok Pixel, LinkedIn Insight Tag a X (Twitter) Pixel. • Ukáže výchozí souhlas (např. cookies) nastavený na webu a co se ukládá před interakcí uživatele. • Používá AI model (Grok) k poskytnutí kvalitativní analýzy obsahu dokumentů. Jak používat? 1. Zadejte adresu webu, který chcete analyzovat. 2. Spusťte audit a počkejte, až nástroj najde dokumenty, zanalyzuje souhlas a detekuje trackery. 3. Zkontrolujte a případně upravte nalezené dokumenty. 4. Spusťte AI analýzu pro detailnější posouzení. 5. Prohlédněte si výsledky a zjistěte chybějící nebo nevyhovující části a detaily AI analýzy. Technologie: Flutter, Supabase, Vercel, Grok 3. Tento nástroj byl vytvořen v rámci projektu Narrativva Labs. Máte-li dotazy nebo připomínky, kontaktujte nás na

source: Change language
cs: Změnit jazyk

# errorUpdateUrl
source: Failed to save the change. Please try again.
cs: Nepodařilo se uložit změnu. Zkuste to prosím znovu.

# errorAuditIdNull
source: Audit ID is null – cannot proceed.
cs: Audit ID je prázdné – nelze pokračovat.

# urlEmpty
source: Please enter a URL
cs: Vyplňte URL

# urlInvalid
source: Enter a valid website address (e.g., https://example.com)
cs: Zadejte platnou adresu webové stránky (např. https://example.com)

# aiNotRunInLastAudit
source: AI analysis was not performed in the last audit.
cs: V posledním auditu nebyla provedena AI analýza.

source: Copy
cs: Kopírovat

source: Copied to clipboard!
cs: Zkopírováno do schránky!

# homeHeadline
source: Automated legal audit & tracker analysis
cs: Automatizovaný právní audit a kontrola trackerů

# homeSubtitle
source: Check your privacy policy, cookies, terms, and discover which trackers are measuring user data—with or without consent.
cs: Zkontrolujte zásady, cookies, podmínky i to, jaké trackery měří data uživatelů – a zda správně respektují souhlas.

source: AI Analysis
cs: AI Analýza

# statusCompliant
source: Compliant
cs: V souladu

# statusAttention
source: Needs Attention
cs: Vyžaduje pozornost

# statusNonCompliant
source: Non-compliant
cs: Není v souladu

# websiteUrlHint
source: Paste your website URL (e.g. https://example.com)
cs: Vložte adresu webu (např. https://vasedomena.cz)

# inputFormTitle
source: Analyze your website for legal & privacy risks
cs: Analyzujte svůj web z pohledu práva a soukromí

source: Analyzing...
cs: Analyzujeme...

# disclaimerText
source: This tool is provided for informational purposes only. We are not legal professionals and do not provide legal advice. Use of this tool does not establish any attorney-client relationship.
cs: Tento nástroj slouží pouze pro informační účely. Nejsme právníci a neposkytujeme právní poradenství. Používání tohoto nástroje nezakládá žádný právní vztah mezi klientem a advokátem.
